<a href="https://colab.research.google.com/github/johyunkang/py_pandas/blob/main/excel_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas 를 이용한 엑셀 문서 편집 방법

### 1. 엑셀 문서를 불러오기 위한 드라이브 마운트

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

### 2. 엑셀 파일 경로 설정

In [3]:
import pandas as pd
PATH = '/content/drive/MyDrive/colab/'

df = pd.read_excel(PATH + 'raw_file.xlsx')
df.head()

  name    bs_ymd  site_nm site_nm1 site_nm2  cnt
0  손나은  20210222  samsung  samsung      NaN  1.0
1  성유리  20210222      hld      hld      NaN  1.0
2   현아  20210222      ksp      ksp      NaN  1.0
3   나연  20210222      bnk      bnk      NaN  1.0
4   다연  20210222       mg       mg      NaN  1.0

### 3. 문서 확인 및 편집

In [5]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      25 non-null     object
 1   bs_ymd    25 non-null     int64
 2   site_nm   25 non-null     object
 3   site_nm1  25 non-null     object
 4   site_nm2  4 non-null      object
 5   cnt       25 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 1.3+ KB

             bs_ymd        cnt
count  2.500000e+01  25.000000
mean   2.021022e+07   0.960000
std    8.164966e-01   0.138444
min    2.021022e+07   0.500000
25%    2.021022e+07   1.000000
50%    2.021022e+07   1.000000
75%    2.021022e+07   1.000000
max    2.021022e+07   1.000000

### 3.1 데이터프레임의 컬럼 타입 변경

In [22]:
df = df.astype({'bs_ymd':'object'})  # int > object 로 변경
#df.info()

df.head(5)

df_grp = df.groupby(by=['bs_ymd', 'name']).count()
df_grp.head(20)

               site_nm  site_nm1  site_nm2  cnt
bs_ymd   name
20210222 나연          1         1         0    1
         다연          1         1         0    1
         성유리         1         1         0    1
         손나은         1         1         0    1
         아린          1         1         0    1
         아이유         1         1         0    1
         현아          1         1         0    1
         효리          1         1         1    1
20210223 나연          1         1         0    1
         다연          1         1         1    1
         성유리         1         1         0    1
         손나은         1         1         0    1
         아린          1         1         0    1
         아이유         1         1         0    1
         현아          1         1         0    1
         효리          2         2         2    2
20210224 나연          1         1         0    1
         다연          1         1         0    1
         성유리         1         1         0    1
         손나은         1         1         0    1